## Plan Result (nle-uksouth-nle)




<pre><code>Plan: 15 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.nle-hmcts-net.azurerm_dns_a_record.this[&#34;caps.db&#34;]
  * module.nle-hmcts-net.azurerm_dns_a_record.this[&#34;pcol.db&#34;]
  * module.nle-hmcts-net.azurerm_dns_zone.zone
  * module.nle-hmcts-net.azurerm_role_assignment.dnszonecontributer
  * module.public-dns.azurerm_dns_a_record.this[&#34;darts-service&#34;]
  * module.public-dns.azurerm_dns_a_record.this[&#34;testclaim-pcol&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;caps&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;cman&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;mcnotify&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;mcol&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;pcnotify&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;pcol&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;sdt&#34;]
  * module.public-dns.azurerm_dns_zone.zone
  * module.public-dns.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.nle-hmcts-net.azurerm_dns_a_record.this["caps.db"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "caps.db"
      + records             = [
          + "10.24.242.4",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "nle.hmcts.net"
    }

  # module.nle-hmcts-net.azurerm_dns_a_record.this["pcol.db"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "pcol.db"
      + records             = [
          + "10.25.248.196",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "nle.hmcts.net"
    }

  # module.nle-hmcts-net.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "nle.hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.nle-hmcts-net.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2cab9ccf-e755-4b58-a6b6-692705f3e79d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.public-dns.azurerm_dns_a_record.this["darts-service"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "darts-service"
      + records             = [
          + "20.49.140.58",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "nle.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_a_record.this["testclaim-pcol"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "testclaim-pcol"
      + records             = [
          + "51.142.82.12",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "nle.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["caps"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "caps"
      + record              = "firewall-nonprodi-palo-capsnle.uksouth.cloudapp.azure.com"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "nle.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["cman"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cman"
      + record              = "firewall-nonprodi-palo-cmannle.uksouth.cloudapp.azure.com"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "nle.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["mcnotify"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "mcnotify"
      + record              = "firewall-nonprodi-palo-mcolnle.uksouth.cloudapp.azure.com"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "nle.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["mcol"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "mcol"
      + record              = "firewall-nonprodi-palo-mcolnle.uksouth.cloudapp.azure.com"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "nle.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["pcnotify"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "pcnotify"
      + record              = "firewall-nonprodi-palo-pcolnle.uksouth.cloudapp.azure.com"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "nle.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["pcol"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "pcol"
      + record              = "firewall-nonprodi-palo-pcolnle.uksouth.cloudapp.azure.com"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "nle.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["sdt"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sdt"
      + record              = "firewall-nonprodi-palo-sdtnle.uksouth.cloudapp.azure.com"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "nle.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "nle.platform.hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.public-dns.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2cab9ccf-e755-4b58-a6b6-692705f3e79d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":958,"Program":"tfcmt","SHA1":"","Target":"nle-uksouth-nle","Vars":{}} -->